[
{"speaker":"Ulrika Malmgren ","title":"Fem myror är fler än fyra elefanter","description":"- Ett tal om siffror och teamstorlek\nÄven om teamstorlek visserligen bara är en unka liten siffra i sig själv så trillar en mängd andra siffror ur den när man kikar noggrannare.\nJag vill hävda att teamstorlekssiffran kanske är Ursiffran, den viktigaste siffran och den som i störst grad bestämmer hur din vardag ser ut.\nVilken siffra tror du är den bästa i så fall? Det magiska 7+-2? Mer? Mindre? \nSpoiler: 4! (fast mindre)"}
,
{"speaker":"Tom Tingstadius","title":"Kan jag beställa innovation av dig?","description":"Jag blev helt ställd när jag fick frågan och samtalet vid kaffeautomaten dog liksom ut när jag i ett försök att byta ämne mumlade något om att mjölken var slut. Nu några år senare hoppas jag på att få frågan igen, för jag tror jag har kommit på det! Hur man skapar förutsättningar för att kunna beställa innovation alltså."}
,
{"speaker":"Petter Wigle","title":"Vägledd av smärta","description":"När vi känner smärta är det en signal till oss att vi behöver göra en förändring.\nVi kan välja olika sätt att förhindra smärtan. Får man ont av att göra sit-ups så kan man antingen träna för att bli starkare eller så kan man välja att inte göra sit-ups alls. När smärtan gör sig påmind i vårt arbete med systemutveckling har vi på samma sätt flera valmöjligheter. Hur vi väljer har stor påverkan på om vi kommer förbättra vårt arbetssätt eller fortsätta i gamla hjulspår. Vi kommer gå igenom några vanliga källor till smärta och hur den kan leda oss till att bli bättre på att bygga mjukvara."}
,
{"speaker":"Sabrina romanov, Anders Hermansson","title":"Vår resa från trist till Teal","description":"Hur vi implementerade Teal och vilka hinder vi stötte på vägen. En beskrivande resa om hur man kan göra för att bli en Teal organisation."}
,
{"speaker":"Andrew Walker","title":"Silent estimation: Bättre estimering på mindre tid","description":"Det finns många sätt att estimera en backlog men de tar mycket tid, är ofta inte exakt och tar inte hansyn till de olika kompetenser. Hur kan tystnad hjälpa till med det? På 10 minuter ska jag visa dig!"}
,
{"speaker":"Anna Forss","title":"Strukturell dumhet - om när smarta människor blir en dum grupp","description":"Strukturell dumhet förekommer överallt. Men vad är det? Varför uppstår det och hur kan du motverka strukturell dumhet hos dig själv och i din organisation"}
,
{"speaker":"Magnus Tholén","title":"Oops we did it again","description":"Här kommer ett väldigt retro retrospektiv som grundar sig i RUP. Få nämner RUP i diskussioner om agil utveckling men rätt använt var det fullt möjligt att jobba agilt med RUP. Detta lilla tal belyser de fel man oftast gjorde med RUP och är i full färd med att göra med Scrum. "}
,
{"speaker":"Yassal Sundman","title":"Stop Managing Bugs!","description":"How to stop managing bugs and start focusing on quality. A no-nonsense, straightforward, binary methodology that any team can have up and running in no time!"}
,
{"speaker":"David Asarnoj","title":"Engagerade teammöten - Lean Coffee Style","description":"Teammöten upplevs ofta som ett nödvändigt ont av såväl chefer som medarbetare. \nJag berättar om hur vi med hjälp av Lean Coffee-conceptet ändrade våra teammöten till att bli engagerande och givande, samt ett par lärdomar vi gjort under resans gång"}
,
{"speaker":"Victoria Normark","title":"Kejsaren är naken! Om att leka chef på jobbet","description":"Jag berättar om när jag blev chef för första gången och upplevde att rollen var en charad. Fortfarande betraktas rollen som någon som står över sin personal i rang. Detta synsätt påverkar såväl språk som handlingar i vardagen. När man inser att kejsaren är naken kan skådespeleriet bli allt från sorgligt till nästan underhållande."}
,
{"speaker":"Dick Lyhammar","title":"Genus, glastaket och fyndmarknaden ","description":"Jag kommer ge er en överblick över genusfrågan i verkligheten i vanliga svenska företag, hur tjockt glastaket egentligen är och hur den som vill och är medveten kan fynda när den gör rekryteringar. Var är vi idag och vad kan vi göra för att skapa en mer jämlik framtid i mjukvaruindustrin. "}
,
{"speaker":"Thomas Svensson","title":"Rapport från kanten av min förmåga","description":"Att lyckas med förbättringsarbete är svårt. Så svårt att även om jag använder alla tips och tricks från alla böcker och kurser jag har snuddat vid så kommer mina förändringar fortfarande att vara experiment med osäkra resultat. Om jag gör allt jag kan men fortfarande är beroende av slump/tur för att lyckas så befinner jag mig på kanten av min förmåga. Det är ett intressant ställe att vara på. På ena sidan ett ovärdigt fall och skammens brännässlor, men på andra sidan accelererad utveckling, gruppens respekt och tacksamhet. I den här presentationen berättar jag hur jag hanterar och tar mig an uppgifter med väsentlig risk för nederlag och varför det ändå är värt det."}
,
{"speaker":"Staffan Nöteberg","title":"Jesusbarnet och stjärnan -- men *när* är ni klara?","description":"”We have a wanted position, but no fixed plan to get there.” Vem sa så – IT-entreprenören, parprogrammeraren, Donald Trump eller högste chefen på en hundraårig sparbank? Eller var det Wu Yongning – rooftoppingens tragiskt bortgångna konung – som sa det? Ledstjärna eller backlog-avverkning när riskhantering är viktig? Och är inte sprint ändå ett mini-projekt?"}
,
{"speaker":"Jenny Höglund Svensson","title":"Led hjärnan rätt","description":"Varför har jag så lätt att hänga med och testa vissa människors idéer när jag kan vara så skeptisk mot andras förslag? Denna fråga fick mig att fundera över hur ledarskap utövas, vad säger dagens forskning om hjärnan och hur hänger det ihop med Googles resultat om snällhet och trygghet i team? Svaret på dessa frågor ledde mig till Neuroledarskap. Nyfiken? - Kom och lyssna på kortversion av hur du kan skapa de bästa förutsättningar för dina medarbetares hjärnor."}
,
{"speaker":"Ove Lindström","title":"Crash Coaching - agil utveckling av motorcyklister","description":"Att coacha ett agilt team ställer vissa krav. Det är alltid lite skrämmande att göra förändringar som kan ställa till det i produktion. Men hur farlig är en bugg egentligen? Hur använder man agila metoder för att skapa förändring på ett säkert sätt när man utbildar motorcyklister när en \"bugg\" kan göra ont på riktigt?\n\nVi tar en kort liten resa genom en kursdag som ger en ett par verklighetsförankrade metaforer att använda även inom agil mjukvaruutveckling."}
,
{"speaker":"Viktor Cessan","title":"Detta behöver du tänka på för att lyckas med din feedback","description":"Mycket av det vi tror är riktig feedback är i själva verket pseudofeedback  t.ex. råd, ifrågasättande, dömande eller psykologiska utvärderingar m.m. Pseudofeedback i kombination med statusdynamiken som råder mellan två personer förklarar varför individer kan reagera så olika på ett och samma feedbacksamtal och varför feedbacksamtal mellan en chef och en anställd kan förstöra en relation för gott.\n\nI mitt blixtal kommer jag att avkoda feedback och för att visa några vanliga saker vi misstar som feedback. Jag berör också varför det ibland blir så fel med feedback dvs varför vissa älskar det medan andra skyr det, och om det verkligen finns något som heter negativ eller konstruktiv feedback.\n\nVälkomna!"}
,
{"speaker":"Jan Grape","title":"Vi är agila, men vår arkitektur är gjuten i betong :-(","description":"Att jobba med arkitektur i en agil miljö är utmanande, eftersom man gärna vill stå på fast grund, men nya behov och krav strömmar in i ett kontinuerligt flöde samtidigt som vi levererar vår produkt. Hur skall man tänka kring arkitektur då?\n"}
,
{"speaker":"Maria Gustafsson, Maya Jernström ","title":"Vårt största projekt någonsin utan planer och kontroll?!","description":"Vi stod inför utmaningen att våra bassystem från tidigt 90-tal skulle ersättas med en SAP-modul. Många banker har försökt, många har misslyckats med tråkiga löpsedlar som slutresultat. Vi lovade att just vi skulle klara det, trots mindre muskler än andra om vi bara fick jobba agilt, vi vill därför dela med oss, hur jobbar vi idag och vad har vi lärt oss av detta och bevisa att stora projekt faktiskt går att kombinera med ett agilt arbetssätt "}
,
{"speaker":"Sebastian Åkerman","title":"Minimum Viable Security","description":"Begreppet Minimum viable product (MVP) används för att beskriva den minsta mängd krav eller features som vi måste implementera för att få en produkt som vi kan utvärdera ur ett användarperspektiv. Det vill säga det billigaste vi kan komma undan med för att faktiskt kunna testa vår produktidé. Minimum viable security bygger på samma princip. Vad är den lägsta nivå av säkerhet som vi kan komma undan med utan att äventyra våra kunders förtroende eller riskera att bryta mot lagar och regelverk?\n\nEn MVP exponerar begränsad funktionalitet och information för en (i regel) begränsad användargrupp. Ska vi behöva implementera alla säkerhetskrav som behövs för den fullständiga lösningen även för en MVP? Eller kan vi hitta en minsta nivå av säkerhet som duger för den begränsade riskexponering som en MVP innebär?"}
,
{"speaker":"Anette Lovas, Ulrika Park","title":"Prototypdrivet arbetsätt","description":"En interaktiv workshop, där deltagarna får utifrån definierade målgrupper bygga prototyper av olika material. Syftet med övningen är att förstå vikten av att visualisera och validera lösningar på ett iterativt och kreativt arbetsätt. "}
,
{"speaker":"Edward Dahllöf","title":"Med den mänskliga naturen - inte mot: Om att organisera och leda företag","description":"Historien om hur Jan Wallander radikalt ändrade nordens största bank år 1970. En förändringsresa som skulle få vilket modernt företag som helst idag att häpna."}
,
{"speaker":"Annika Widmark","title":"Storytelling - konsten att berätta verkliga user stories","description":"\"Som en användare vill jag ha något för att uppfylla något\", en klassisk user story. Men var finns egentligen den verkliga berättelsen och den verkliga användaren bakom vår user story? Jag tänkte dela med mig av mina egna berättelser om hur vi genom storytelling och upplevelser gett liv till våra user stories, och på så sätt ökat engagemang, empati och energi i teamen."}
,
{"speaker":"Joakim Manding Holm","title":"Bowling-kata: TDD för dig som varit för rädd för att fråga","description":"Få saker bidrar mer till god design, högre teknisk kvalitet och psykologisk trygghet för utvecklare än TDD – Testdriven utveckling. Trots detta är enligt min erfarenhet TDD inte så vanligt förekommande som en kan tro, givet hur kraftfullt det är. Det här vill jag ändra på. Denna workshop är riktad till chefer, produktägare, coacher, ja alla ni som har hört talas om TDD, men inte riktigt förstått poängen (och varit för rädd för att fråga). Vi kommer att använda ett känt exempel, bowlingkatan, och ett format inspirerat av Robert C. Martin för att illustrera och prata om vad det är, hur det går till och vad värdet är."}
,
{"speaker":"Markus Elving","title":"Teaching agile post waterfall","description":"Många personer jag möter i min vardag har aldrig upplevt att arbeta i vattenfall och i stora projekt. De har börjat arbeta i en miljö med Agila praktiker och verktyg. Men lyckas de för det? Nej, egentligen inte. Det här är mitt sätt att bemöta dem och hjälpa dem på vägen mot toppen.  "}
,
{"speaker":"Martin Wasielewski","title":"Varför ditt företag misslyckas uppnå sina affärsmål eller att omorganisera och vad du kan göra åt det","description":"Många företag misslyckas att uppnå sina affärsmål eftersom de inte medvetet bygger en företagskultur som gör det möjligt. Ju mer företagskulturen är anpassad till företagets syfte och kontext desto större möjlighet att uppnå målen. Jag tänker dela med mig av en övning jag har utvecklat* som hjälper organisationer och team att konkretisera deras nuvarande kultur och medvetet bygga en ny. \n\n*Baserat på Frederic Laloux’s version av Ken Wilber’s 4 kvadrantsmodel"}
,
{"speaker":"Joakim Ohlrogge","title":"Kan statisk typning vara Agilt?","description":"Minns ni när vi började prata om \"Agila Språk\"? Agila språk var typiskt inte statiskt typade. Statisk typning har länge haft rätt dåligt rykte som oflexibelt och onödigt komplicerat.\n\nJag har senaste åren ansträngt mig för att bli vän med statisk typning på riktigt. Det har givit en del trevliga insikter och överraskningar.\n\nPrinciper som \"gör illegala tillstånd orepresenterbara\" är väldigt kraftfulla till och med med så dåliga typsystem som Javas. Hjälpsamma kompilatorer som Elm och i viss mån Rust gör det lite mindre smärtsamt att bråka med compilern. \n\nJag skulle vilja prata lite om hur jag lyckats nå en nivå då jag faktiskt börjar lita på att om min kod kompilerar så fungerar den. Hur jag typar innåt och testar utåt för att säkerställa att min kod fungerar.\n\nJag ser tester som den vetenskapliga modellen och typer som matematik som kan bespara mig ett par experiment. Jag vill också prata lite om varför statiska typsystem är svåra och i viss mån begränsande jämfört med dynamiska dito.\n\nJag tror att jag i egenskap av tidigare typskeptiker kan ge en nyanserad bild av skillnaderna mellan ett statiskt och ett dynamiskt synsätt."}
,
{"speaker":"Morgan Ahlström","title":"På edra platser, färdiga, stanna upp!","description":"\"Mellan stimuli och respons finns ett litet utrymme, och i detta utrymme finns den fria viljan.\" - Viktor E. Frankl\nVi begränsar gärna oss själva och vår respons med självpåtagna regler som ofta spelat ut sin roll men ändå håller oss i ett järngrepp. Tänk om vi kunde stanna upp processen och fritt välja hur vi skulle agera i varje situation istället. Här kommer några knep runt hur vi kan skapa nya och bättre val i våra interaktioner med andra."}
,
{"speaker":"Visualization as a tool to handle complexity","title":"Visualization as a tool to handle complexity. We can improve only what we can see.","description":"What is visualisation and how we can use it in our day by day work? Basic concepts and Hands on exercise."}
,
{"speaker":"Jesper T Nyström","title":"Hur vi använder tavlan för att öka farten och vinna…","description":"Många team har dagliga möten för att synka sig med varandra, och det görs på många olika sätt. Här finns det inget rätt eller fel. Bara mer eller mindre bra sätt. \nFör att mötet ska bli så bra som möjligt måste det råda transparens. Det är en av de agila grundpelarna. Då måste det vara sanningen som finns på tavlan, oberoende om den är digital eller analog. Det teamet jobbar med är det som syns på tavlan. Inget göms och allt som finns på tavlan är aktuellt.\nHur kan man använda tavlan och informationen som finns för att öka farten? Hur vinner man i det spel som kallar systemutveckling som vi spelar dagligen?"}
,
{"speaker":"Laszlo Fischer","title":"Skalning i skuggan av Conway","description":"Agil skalning med SAFe och andra ramverk har snabbt blivit populära och vuxit lavinartat bland större techbolag. Syftet är välmenat, målet guldkantat, men vägen mot målet kan bli en smärtsam process om man skalar utifrån befintlig organisationskarta som enda input. Låt oss tillsammans ta en titt på erfarenheter från en bit på vägen. "}
,
{"speaker":"Rickard Westman","title":"Musikproduktion som en iterativ, distribuerad, agil process","description":"Att musikindustrin har förändrats i grunden känner alla till. Men även musikproduktionen har transformerats – mot något som kan ha stora likheter med en agil utvecklingsprocess. Här berättar Rickard Westman, till vardags utvecklingschef på SVT, om arbetet med Garmarnas skiva ”6” – och om vad som förändrats under de 15 år av tystnad som föregick den. "}
,
{"speaker":"Andreas Larsson","title":"Teknik - vem får välja det och vem får leva med det?  ","description":"Teknikval påverkar organisationer på många sätt. \n\nOm ett team inte får tillgång till moderna ramverk och effektiva verktyg går det ut över mängden kundvärde de kan leverera. Om alla team blir sittande med underhåll och drift av helt egna tekniklösningar så går det också ut över vilket kundvärde organisationen kan leverera. Jag vill presentera en liten modell om hur vi skulle kunna tänka kring beslutsgångar för teknikval och hur de kan variera beroende på var i sin livscykel tekniken befinner sig. "}
,
{"speaker":"Sami Spjuth","title":"Open Space Demo","description":"Demon är ett utmärkt tillfälle dela information och kunskap och även få feedback på det man byggt. Feedback är en central del i inspect-adapt cykeln - ändå är de flesta demos jag sett nästan helt utan interaktion och feedback. Jag pratade för 2 år sedan Agila Sverige, då om collaborative demo (designad för extern demo) på agila sverige. Efter det har jag använt en annan typ av demo - Open Space Demo - som är mest designad för intern demo. Så välkomna och få ännu en ide på hur ni kan testa göra en demo. Kanske ger den mer feedback och interaktion även för er."}
,
{"speaker":"Isabelle Olsson","title":"Slappna av, kunden är glad och lite kattbilder är aldrig fel","description":"Allt flöt bra. Tekniken funkade. De tre kundrepresentanterna spridda mellan kontor i New Jersey, Stockholm och Malmö hörs perfekt. Vi har en agenda och min kollega börjar med punkt ett. Men sen, vad hände egentligen? Kidnappade just kunden vårt möte för att prata kattbilder? \nNån gång de senaste åren har vi lyckats få samarbetet att fungera trots avstånd och nu avancerat från motpart till kollegor. Småprat om katter är bara ett av många (positiva) tecken att hålla utkik efter.\n"}
,
{"speaker":"Matti Klasson","title":"Agile Governance - Att fostra en agil kultur","description":"Det här blixttalet är snapshot av vad vi gör på King för att fostra en agil kultur på team , studio (Stockholm) och Global (King) nivå. Min ambition är att både start ups och \"drakar\" under agil transformation kan inspireras och ta med sig något konkret att testa direkt efter konferensen. Find local needs, try small, scale out!"}
,
{"speaker":"Björn Tikkanen","title":"Trettitre tips till teamet","description":"33 konkreta tips som vi kan ta till för att bygga team, bli effektivare och inspirera till agilitet. Det är saker jag samlat på mig under ett antal år och antingen genomfört eller velat testa."}
,
{"speaker":"Mia Kolmodin","title":"Aktivitetsbaserade kontor + Agile = Flexibelt och superbra. Eller?","description":"Får vi de bästa förutsättningarna att göra ett bra jobb om vi ska arbeta agilt men samtidigt sitter i ett aktivitetsbaserat kontor? \n\nAktivitetsbaserade kontor har blivit en trend bland många företag, samtidigt som man säger sig vilja arbeta utifrån agila principer. Hur fungerar det i praktiken för medarbetarna som ska arbeta i fasta team att göra ett bra jobb när man inte vet vart de andra i teamet är från dag till dag? Som bas för det här blixttalet ligger inte talarens egna tankar - utan faktiskt data och citat från en undersökning gjord i april 2018."}
,
{"speaker":"Tommy Ågren","title":"Big Room Planning - En ulv i fårakläder?!","description":"Bygger vi agilitet eller lappar vi bara en dålig organisationsdesign?"}
,
{"speaker":"Linn Keife","title":"Så glada att vi vågade self selection!","description":"En väldigt praktisk genomgång av hur vi på Avanza skapade 13 nya team via self selection. Planering, farhågor och hur själva teamväljandet gick till. Och hur resultatet blev!"}
,
{"speaker":"Carina Meurlinger","title":"Darwin hade varit agilist","description":"En betraktelse om tro hopp och kärleken till förnuftet."}
,
{"speaker":"Joel  Sanderi","title":"Hur jag effektivt gjorde alla stakeholders besvikna, och hur en donut blev räddningen","description":"Som Product Owner känns det ibland som att alla stakeholders är missnöjda med att inte just deras områden prioriterats högre, eller att de upplever leveranstakten som låg. I denna session berättar jag om ”steak donut”-modellen, som ett verktyg både för att prioritera mer långsiktigt, samt för att bättre visualisera prioriteringarna och därmed sätta rätt förväntansnivå."}
,
{"speaker":"Lennart Fridén","title":"Mobbfacilitering","description":"Jobbar du i en mobb som behöver hjälp?\n\nFunderar du på att introducera mobbprogrammering till ditt team, men håller dig själv tillbaka på grund av att du är rädd för hur de ska ta det?\n\nHar du alltid velat se eller vara en del av Agila Sveriges improvisationsteater som iscensätter farhågor, funderingar och frågeställningar?\n\nVill du bara dela förlösande skratt och insiktsfulla upplevelser med andra konferensdeltagare?\n\nOm något av ovanstående stämmer så är detta workshoppen för dig!"}
,
{"speaker":"John Cirverius","title":" Lyssna och bygg förtroende","description":"Händer det ibland när du lyssnar på andra, antingen bara ni två tillsammans eller i en större grupp, att du inte riktigt är närvarande?\n\nDu kanske tänker på något annat, du kanske tänker på vad du ska säga härnäst? Vilken fråga du ska ställa? Vad du ska göra för att driva konversationen i den riktning du vill ha den?\n\nVad upplever du när du får tanken att personen du pratar med inte riktigt är “här med dig”?\n\nDet är inte alltid lätt att lyssna, men det är väldigt nyttigt att kunna.\n\nFör vem lyssnar vi? Svaret på det påverkar våra frågor. Hur hjälper mina frågor att öppna upp och skapa nya idéer? Hur skiljer sig utforskning från  informationssökning?\n\nDet här vill jag gärna utforska tillsammans med dig. Genom ett par korta övningar kan vi träna på att aktivera vårt lyssnande och få en bättre insikt i hur frågor kan hjälpa oss och andra."}
,
{"speaker":"Pontus Bergöö","title":"Little’s lag – en liten lag om flöde med stora implikationer","description":"”Vi jobbar ju nästan ihjäl oss men ändå klagar ni på att inget blir klart.” Alla pratar om flödeseffektivitet nu för tiden men vad betyder det egentligen? Det här är en genomgång av en central formel i flödesteorin med illustrerande exempel ur verkligheten."}
,
{"speaker":"Inga-Lill Holmqvist","title":"Trust - a foundation for successful agile transformations?","description":"Är tillit viktigt för att lyckas med agila transformationer? Varför då? Och vad är det egentligen som skapar tillit? Vilka beteenden hos en ledare bygger tillit? Detta är frågor som jag besvarar utifrån mina erfarenheter som agil coach samt ger några konkreta tips på vad man kan göra.\n"}
,
{"speaker":"Ola Ramström","title":"Schimpanser, Scaled agile och Scanias Servicemarknadverktyg","description":"Forskningsresultat från människans evolution är användbara för agilt arbete med många inblandade. Erfarenheterna konkretiseras genom ett projekt för att modernisera ett IT-system för Scanias servicemarknad."}
,
{"speaker":"Dennis Liljedahl","title":"Hur jävla agilt blev det här?","description":"Jag har en förmåga att hamna på ekonomiskt välmående företag som inte vill bli agila. De vill bara få mer gjort snabbare. Att implementera agila metoder som Scrum på ett team brukar ändå vara ganska lätt och snabbt ge viss effekt. Det är dock svårt att få full effekt när inte hela företaget vill agil-organisera sig.\n\nMen vad är egentligen agilt? Behöver det se ut som exemplen i böckerna? Eller är det bara en resa med ett manifest och några principer i ryggsäcken?\n\nDet här talet handlar om att använda de 12 agila principerna för att resa mot agil-landet. Och att agilt inte har en viss form."}
,
{"speaker":"Per Lundholm","title":"Ett rött piller för din agilitet","description":"Många organisationer inför Scrum och installerar Jira i förhoppning om att de ska uppnå fördelarna med att arbeta agilt. Men det är inte så enkelt. Efter ett tag står det klart att det blev inte så värst annorlunda. Man har inte hittat till det agila tänkesättet.\n\nNu kommer frågan, hur får vi till det agila tänkesättet lika enkelt som vi installerade Jira? Vi har idag svaret, ett litet rött piller. Med en regelbunden dos kommer insikterna till brukaren utan annan ansträngning.\n\nVi vill här presentera resultatet från flera års omfattande forskning som ledde fram till pillret som nu revolutionerar världen. Vilka försökspersoner påverkades? Hur påverkades de? Dog någon?\n\nGivetvis kommer det att delas ut prover."}
,
{"speaker":"Lars Albertsson","title":"Big Data == Lean Data","description":"Big data förknippas främst med AI och ny teknik. Det är dock lika mycket en revolution i samarbetsmönster. Big data medför en demokratisering av data inom en organisation, vilket möjliggör agil, datadriven innovation på ett sätt som tidigare inte var möjligt. Hur gör man då som organisation för att skörda frukterna och vad kan gå fel?"}
,
{"speaker":"Håkan Lövén","title":"Organisations-psykologiska utmaningar vid agil transformation","description":"När människors arbetssituation förändras utlöses ett antal förutsägbara mekanismer i allmänhet, när man går från ett plandrivet arbetssätt till agilt i synnerhet.\nHär får du en intuitiv förståelse för dessa, med tillhörande fallgropar, samt medel för att möta upp de samma."}
,
{"speaker":"Stefan Norinder","title":"Grupper - hur de bildas, varför de hatar varandra och vad vi kan göra åt det","description":"Med utgångspunkt från en serie socialpsykologiska experiment utförda runt 1950 tänker jag berätta om med vilken lätthet vi människor identifierar oss med grupper, hur vi naturligt skapar misstänksamhet mot andra grupper och vad vi kan göra för att överbrygga denna misstänksamhet. \n"}
,
{"speaker":"Håkan Lövén","title":"Gruppdynamik i ett nötskal","description":"Självorganiserande och tvärfunktionella team, som tyvärr är lätt att göra svårt, när det egentligen borde vara tvärt om.\nUnder den här workshopen (övningen) får du förståelse för mekanismerna bakom gruppdynamik, samt hur att bidra för att kanalisera den potentialen i större utsträckning.\nDeltagarna kommer kunna ta med sig övningen hem (med tillhörande verktyg), och genomföra med sitt egna team/organisation."}
,
{"speaker":"Gereon Kåver","title":"Growth som agil murbräcka","description":"SVT interaktiv har länge varit en agil klick i en mer traditionell organisation. Growth har varit ett sätt att hitta ut för att förändra kultur på riktigt.   "}
,
{"speaker":"Esbjörn Hyltefors","title":"Tre sorters agila förändringsledare","description":"Jag har observerat tre olika agila förändringssituationer och tre korresponderande typer av agila förändringsledare, var och en med unik kompetens, inställning och verktygslåda:\n- Förbättraren, expert på ständiga förbättringar \n- Paradigmskiftaren, expert på transformationer\n- Hollistikern, expert på förändringsstrategi\n\nVar och en av förändringsledartyperna är starka i “sin egen\" förändringssituation men får jobba i uppförsbacke i andra, ofta utan att förstå varför. Att bli medveten om förändringssituationerna och förändringsledartyperna är därför som att få en karta med genvägar och hinder vid agila förändringar. "}
,
{"speaker":"Jimmy Sjölund","title":"Friskt vågat, hälften jobbat!","description":"Hur bättre samarbete ledde till mindre jobb och en mer nöjd kund.\n\nKunden var frustrerad. Vi var stressade. Vi var även överbelastade och flaskhalsen i kundens utveckling. Genom att anta ett mer öppet och agilt tankesätt för att arbeta tillsammans, så förändrades allt."}
,
{"speaker":"Marcus Ahnve","title":"Hur stoppar vi den agila arenarocken?","description":"Skalad agila processer har kommit att bli det sätt som riktiga och bra företag ägnar sig åt seriös och rejäl systemutveckling. Med riktigt många agila team kan man leverera jättemycket kod toksnabbt.. Med tydliga processmallar och best practices kan man se till att agila metoder levererar med samma förutsägbarhet som RUP, fast 20% snabbare. Typ.\n\nAgilt har gått från att vara rebellisk punk till storsäljande men intetsägande arenarock . Jag kommer att ägna 10 minuter åt att förklara hur vi stoppar den. "}
,
{"speaker":"David Sundelius","title":"Arkitektur som bidrar till agilitet","description":"Teamen är på plats, värdeströmmarna är på plats och ni försöker leverera värde till kund i korta inkrement, men någonstans tar det stopp. Hur går vi tillväga för att omforma en gammal monolit till en föränderlig och lättrörlig produkt som uppfyller användarens behov? Kan arkitektur till och med bidra till bättre organisatorisk agilitet?"}
,
{"speaker":"Eva Mattsson & Ingela Strandh","title":"Våga experimentera & visualisera!","description":"Sluta klaga på felaktiga eller luddiga krav, utan börja välkomna oklara krav! Se hela kravarbetet på samma sätt som lösningsarbetet – dvs agilt och gemensamt experimenterande, som styrs av en kravare. Kravarens bästa arbetsredskap är visualisering.  Visualisering snabbar upp processen samt gör att man får en betydligt bättre och gemensam bild över behoven."}
,
{"speaker":"Sigrun Tallungs","title":"Träffa Agiles hemliga kusin Design Thinking","description":"Design Thinking är kusinen du önskar du träffat tidigare. Hen kan nästan allt, t ex bygga en empatimotor och laga trasiga feed backloopar."}
,
{"speaker":"Dan Eidmark","title":"Experimentera mera!","description":"Ett IoT-späckat skräck-scenario i skogen för rollspelande entusiaster? Ett spännande, kul och ett mycket komplext problem att lösa. Hur får man till exempel folk att bli rädda, på riktigt? \n\nFör att vandra in i det okända, anammade vi något av en experiment-driven utvecklingsmetodik. Varje experiment utformades för att maximera lärande och samla kvalitativ feedback från spelare. \n\nExperiment visade sig vara ett perfekt verktyg som hjälpte oss att undvika over-engineering och få en switch i fokus från att bygga features till att skapa en upplevelse. \n\nDet blev en resa av sicksackande i produktvisionen och resultatet blev helt skilt från våra ursprungliga tankar och idéer.\n\nKom och lyssna så berättar jag mer!"}
,
{"speaker":"Fredrik Viljesjö","title":"Skala upp med ramverk eller verktygslåda?","description":"Det är mycket prat om ramverk som SAFe, DAD och LeSS. Många säger att ramverken ska ses som verktygslådor. Är våra företag mogna för det? "}
,
{"speaker":"Gitte Klitgaard","title":"Is Yoda really an agile coach?","description":"There is no clear definition of an agile coach, so it can be anything from a process enforcer to a growth enabler. Gitte likes to use Jedi tricks in agile coaching and will tell you why Yoda may be the ultimate agile coach."}
,
{"speaker":"Tobbe Gyllebring","title":"Sluta försöka testa in kvalité!","description":"Kvalité är resultatet av ett system. Ett system som i sig själv kan vara mer eller mindre kvalitativt. Att försöka testa in kvalité är lönlöst. Att förlita sig på inspektion, en parodi på systemtänkande. \n\nFrån Aristotoles till Deming undersöker vi hur vi på det stora hela fått alltihop om fel bakfot och hur vi förhoppningsvis tillsammans kan göra bättre."}
,
{"speaker":"Michael Göthe","title":"Effektivt agilt beslutsfattande med Consent.","description":"Hur tas beslut i din organisation? Går det snabbt och effektivt eller tar det lång tid? I Sverige vill vi gärna undvika top-down beslut men alternativet som oftast är konsensus är ofta oeffektivt. I en komplex och snabbföränderlig värld krävs snabba beslut, med hög kvalitet och många perspektiv. “Wisdom of the crowds”. Vi tittar på Consent som alternativ för att få en mer agile besluts process."}
,
{"speaker":"Jennie Mårtensson","title":"The ART of being a team","description":"Det här med välfungerande team….hur svårt kan det vara egentligen? Varför fungerar en del team så fantastiskt bra och andra inte alls? \nJag kommer att prata om tre hörnstenar för att skapa fantastiska team - hur avsaknaden av dessa märks, och även ge tips för hur man kan bygga upp dessa."}
,
{"speaker":"Robin Bergh","title":"The ASS! (animated system status)","description":"Bra tips och trix om hur man kan visualisera och diskutera kring backend komponenter som saknar visuellt gränssnitt"}
,
{"speaker":"Johanna Olander","title":"Lean UX - maximera lärandet och bygg innovation","description":"Vi lever i en tid där förändringstakten går allt snabbare och innovationer avlöser varandra. Vi bygger fler produkter än någonsin tidigare, men de flesta misslyckas. Vi slösar bort tid och pengar på att bygga fel produkt. Den här presentationen ger dig grunderna i att systematiskt testa produktidéer för att öka möjligheterna att tillföra värde till användarna."}
,
{"speaker":"My Amori","title":"Hur gör du för att förstå dina användare?","description":"I vår strävan att skapa goda användarupplevelser är betydelsen av användarinsikter given. Men när det kommer till att försöka förstå sina användare - finns det rätt och fel sätt att göra det på? Hur vetenskapligt är det med användningstester, och är det fel att utgå från sig själv om man är användare? Denna UX-designer försöker hålla sig borta från pekpinnar, och istället inspirera till mer medvetna val därute i verkligheten."}
,
{"speaker":"Martin Christensen","title":"Agile UX - Från Design Sprints till Mob","description":"Vilka sätt finns det att överbrygga gapet mellan produktutforskning och utveckling? Passar de alla olika typer av team och situationer? Finns det någon silver bullet? Hmmm. Nja. Martin reder ut begreppen och berättar anekdoter inom området som kallas Agile UX."}
,
{"speaker":"Hampus Sethfors","title":"Trender som exkluderar","description":"Trender skapar ofta stora hinder för personer med funktionsnedsättningar. Vilka problem uppstår? Varför blir det så ofta så fel? Och hur gör vi för att trender ska funka för alla, oavsett funktionsförmåga? Här kommer dagens mest kritiska perspektiv på trender. Med en liten ljusglimt som avslutning."}
,
{"speaker":"Nina Boljang","title":"Strategisk produktutveckling i en föränderlig miljö","description":"Hur arbetar vi strategiskt med produktdesign och planering i en agil värld som ständigt förändras? Hur vet vi att teamet håller rätt kurs när vi ständigt lär oss nya saker? Nina delar med sig av hur hon kombinerar metoder för målformulering, prioritering och kontinuerlig återkoppling till ett vinnande koncept som styr oss mot rätt affärsnytta."}
,
{"speaker":"Anneli Olsen","title":"Co-Creation Journey Mapping – deltagande intervjuer med användare","description":"Du har äntligen fått chansen att träffa dina användare. Glöm alla bilder du sett från sterila användbarhetslab med förhörsledare med vita rockar och skrivplattor. Under denna workshop kommer du få lära dig ett mycket enkelt och effektivt sätt att få ut maximalt ur ett möte med användare, tillsammans med användaren."}
,
{"speaker":"Camilla Romander","title":"Hur man utför en design studio","description":"Äkta samarbete och lösa problem tillsammans i ett team är inte alltid enkelt. Design studio är en metod som går ut på att skapa en gemensam förståelse av problemet genom att komma på idéer och bygga vidare på varandras idéer. Under denna workshop kommer du få testa på hur en Design Studio går till. Camilla kommer även dela med sig av sina bästa tips och erfarenheter."}
]
